Revit 2024 API
BuiltInFailures.CurtainWallFailures.GridOutOfOrder Property
 Curtain wall grid lines have changed order.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId GridOutOfOrder { get; }
Visual Basic
Public Shared ReadOnly Property GridOutOfOrder As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ GridOutOfOrder {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CurtainWallFailures Class
Autodesk.Revit.DB Namespace